# -*- org-emphasis-alist: nil -*-

#+TITLE: Pathfinder Character Sheet
#+AUTHOR: Lucas Meyers (Adapted from Jesus Ramos)

* Basic Character Info
  - Name :: Premizzek Preval
  - Race :: Tengu
  - Gender :: Female
  - Height :: 4'4
  - Weight :: 79
  - Age :: 21
  - Alignment :: Neutral
  - Deity :: None
  - Background Occupation :: Wizarding Student (drop-out)
  - Languages :: Common, Tengu
  - Parent :: Rodolf (adopted)

  #+NAME:Size
  |------------|
  | Size Bonus |
  |------------|
  |          0 |
  |------------|

* Character Stats
  #+NAME:Stats
  |---+--------------+-------+----------+------+----------+---------+------|
  | ! | Stat         | Total | Modifier | Base | Inherent | Enhance | Misc |
  |---+--------------+-------+----------+------+----------+---------+------|
  | # | Strength     |     5 |       -3 |    5 |          |         |      |
  | # | Dexterity    |    14 |        2 |   14 |          |         |      |
  | # | Constitution |    12 |        1 |   12 |          |         |      |
  | # | Intelligence |     7 |       -2 |    7 |          |         |      |
  | # | Wisdom       |    19 |        4 |   19 |          |         |      |
  | x# | Charisma     |     7 |       -2 |    7 |          |         |      |
  |---+--------------+-------+----------+------+----------+---------+------|
  #+TBLFM: $3=vsum($5..$8)::$4=floor(($3 - 10) / 2)

  #+NAME:Initiative
  |---+------------+-------+------+------|
  | ! |            | Total | Base | Misc |
  |---+------------+-------+------+------|
  | # | Initiative |     2 |    2 |    0 |
  |---+------------+-------+------+------|
  #+TBLFM: @2$3=vsum(@2$4..@2$5)::@2$4=remote(Stats, @3$Modifier)

* Class
  #+NAME:Class1
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD  | Class Name    | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   |     17 | d10 | Gunslinger    |   2 |      4 |    3 |   3 |    0 |      2 |
  |   |      8 | d10 | Fighter       |   1 |      2 |    2 |   0 |    2 |      1 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  |   | Totals |     | Favored Class |     |        |      |     |      |        |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  | # |     25 |     |               |   3 |      6 |    5 |   3 |    2 |      3 |
  |---+--------+-----+---------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

  #+NAME:Class2
  |---+--------+----+-----------------+-----+--------+------+-----+------+--------|
  | ! |     HP | HD | Class Name      | BAB | Skills | Fort | Ref | Will | Levels |
  |---+--------+----+-----------------+-----+--------+------+-----+------+--------|
  |   |      7 | d6 | Empyereal Sorc. |   1 |      2 |    0 |   0 |    3 |      2 |
  |   |      2 | d6 | Spellslinger    |   0 |      2 |    0 |   0 |    2 |      1 |
  |---+--------+----+-----------------+-----+--------+------+-----+------+--------|
  |   | Totals |    |                 |     |        |      |     |      |        |
  |---+--------+----+-----------------+-----+--------+------+-----+------+--------|
  | # |      9 |    |                 |   1 |      4 |    0 |   0 |    5 |      3 |
  |---+--------+----+-----------------+-----+--------+------+-----+------+--------|
  #+TBLFM: @>$2=vsum(@2..@-2)::@>$5..@>$10=vsum(@2..@-2)

  #+NAME:ClassGestalt
  |---+----+-----+------------+-----+--------+------+-----+------+--------|
  | ! | HP | HD  | Class Name | BAB | Skills | Fort | Ref | Will | Levels |
  |---+----+-----+------------+-----+--------+------+-----+------+--------|
  | # | 25 | d10 | Gestalt    |   3 |      4 |    7 |   5 |    5 |      2 |
  |---+----+-----+------------+-----+--------+------+-----+------+--------|

  #+NAME:Experience
  |------------+-----+------|
  | Experience | 900 | 1300 |
  |------------+-----+------|

  #+NAME:Proficiencies
  |-------------+--------------------------------------+-------------|
  | Class       | Weapons                              | Armors      |
  |-------------+--------------------------------------+-------------|
  | Gunslinger  | Simple, martial, two-handed firearms | Light armor |
  | Wizard/Sorc | Club, dagger, heavy/light crossbow   | None        |
  |             | quarterstaff, firearms               |             |
  | Fighter     | Simple, martial                      | All         |
  |             |                                      |             |
  |-------------+--------------------------------------+-------------|


  #+NAME:Feats
  |-----------------------+----------------------------------------------------------------------------|
  | Name                  | Description                                                                |
  |-----------------------+----------------------------------------------------------------------------|
  | Gunsmithing           | With a gunsmith's kit you can create/restore firearms,                     |
  |                       | craft bullets, and mix black powder, this does not require a craft check.  |
  |                       | Can craft guns at half cost, 1000gp = 1 day of work. Crafting bullets is   |
  |                       | 1/10 the cost, can do alchemical cartridges with 1 rank in craft alchemy.  |
  |                       | Can restore a broken firearm with 1 hour of work.                          |
  |                       | Gunslingers can restore their initial firearm with 300gp and 1 day of work |
  |                       | (this makes the gun masterwork).                                           |
  | Rapid Reload (musket) | Reduce reload time 1 level. Fullround -> standard -> move -> free          |
  | Precise shot          | +1 to attack and damage with ranged weapons when within 30ft.              |
  | Eschew Materials      | Can ignore material components up to 1gp                                   |
  | Precise Shot          | Ignore the -4 for shooting into combat                                     |
  | Rapid Shot            | Full round at (-2) to all for extra shot at max BAB                        |
  |-----------------------+----------------------------------------------------------------------------|

  #+NAME:RacialFeatures
  |-----------------+------------------------------------------------|
  | Name            | Description                                    |
  |-----------------+------------------------------------------------|
  | Sneaky          | +2 racial to perception and stealth            |
  | Glide           | DC15 fly check to fall safely from any height. |
  |                 | An additional fly check (DC15) may be used to  |
  |                 | move 5ft laterally for every 20ft dropped.     |
  | Claw attack     | Two primary claw natural attacks (1d3).        |
  |                 | You count as having Improved Unarmed Strike    |
  | Natural Weapons | You have a bite attack that deals 1d3.         |
  | Senses          | Low-light vision                               |
  |-----------------+------------------------------------------------|

  #+NAME:Traits
  |--------------------------------------+-----------------------------------------------|
  | Name                                 | Description                                   |
  |--------------------------------------+-----------------------------------------------|
  | Magical Knack                        | +2 to sorcerer caster level up to hit die.    |
  | Numerological gift (adopted Dhampir) | Once per day when an 8 is rolled              |
  |                                      | you may treat it as a natural 20.             |
  | Never stop shooting                  | May act as disabled at zero or lower but only |
  |                                      | to: draw, shoot, or reload a firearm. If you  |
  |                                      | have diehard you can use Wis instead of Con   |
  |                                      | to determine death.                           |
  |--------------------------------------+-----------------------------------------------|


  #+NAME:Class1Features
  |----------------+------------------------------------------------------------------------|
  | Name           | Description                                                            |
  |----------------+------------------------------------------------------------------------|
  | Gunsmith       | Begin with a battered musket. All others treat the gun as broken.      |
  |                | You gain gunsmith as a bonus feat.                                     |
  | Grit           | You have grit points equal to your wisdom at the start of each         |
  |                | day. It is regained by bringing an enemy below 0 hp, confirming        |
  |                | a critical hit, or performing a daring act. These do not apply if      |
  |                | they have less than half your hit dice.                                |
  | Deeds          | Deadeye: You can resolve an attack against touch ac at any range       |
  |                | by spending a single grit point.                                       |
  |                | Steady Aim: While you have at least one grit point you can take a      |
  |                | move equivalent action to increase your range increment by 10ft.       |
  |                | This stacks with all other abilities that increase range increment.    |
  |                | Quick clear: Can remove the broken condition from a firearm so         |
  |                | long as it was caused by a misfire so long as you have at least one    |
  |                | Grit point. A grit point can be spent to go from a standard to a move. |
  | Rapid Reloader | You gain rapid reload (muskets) as a bonus feat.                       |
  | Nimble         | +1 dodge bonus to AC                                                   |
  |----------------+------------------------------------------------------------------------|

  #+NAME:Class2Features
  |--------------------+-------------------------------------------------------------------------------------|
  | Name               | Description                                                                         |
  |--------------------+-------------------------------------------------------------------------------------|
  | Spells             | Gets casting as a wizard. No cantrips, but can cast detect magic/read magic as 1st. |
  | Arcane Gun         | Can cast a spells that are ranged touch attacks, cones, lines, or rays through the  |
  |                    | gun. If they have an attack roll they get a x3 crit modifier. The spell gains       |
  |                    | the gun's enhancement bonus to either the attack roll or DC. On a natural 1 or      |
  |                    | if the target rolls a 20 on the save the gun gains the broken condition or          |
  |                    | explodes if it already was broken. The damage for this blast is has the energy      |
  |                    | type of the spell and deals 1d6 per caster level. DC is the same as the spell used. |
  |                    | You can only attune a single arcane gun at a time.                                  |
  | Mage Bullets       | As a swift action you can sacrifice a spell to add an enhancement bonus up to +5    |
  |                    | and dancing, defending, distance, flaming, flaming burst, frost, ghost touch,       |
  |                    | icy burst, merciful, seeking, shock, shocking burst, spell storing, thundering,     |
  |                    | vicious, and wounding as the level of the spell. This lasts a number of minutes     |
  |                    | equal to the spell level or until used again.                                       |
  | School of the gun  | Choose four opposition schools. abjuration, divination, evocation, transmutation    |
  | Heavenly Fire (Su) | 30ft ranged touch attack ray that deals 1d4+(1 per 2 sorc levels) damage to evil    |
  |                    | healing to good. Can only affect with healing once per day used 3+wisdom per day.   |
  |--------------------+-------------------------------------------------------------------------------------|

  #+NAME:GunProperties
  |-------------------+----------------------------------------------------------------|
  | Name              | Description                                                    |
  |-------------------+----------------------------------------------------------------|
  | Range/Penetration | Attacks resolve against touch AC in the first range increment  |
  |                   | but do not count as a touch attack for the purpose of feats    |
  |                   | or abilities. You cannot fire beyond 5 range increments.       |
  | Loading           | 2 handed firearms default to full-round action to load.        |
  | Misfire           | If your attack is in the misfire range it misses and gains the |
  |                   | broken condition and increases the misfire range by 2          |
  |                   | If it misfires again it explodes  and affects those within     |
  |                   | the blast radius as if they'd been shot. DC12 for half         |
  |-------------------+----------------------------------------------------------------|

* Defense
  #+NAME:Saves
  |---+---------------+-------+------+---------+---------+------|
  | ! | Saving Throws | Total | Base | Ability | Enhance | Misc |
  |---+---------------+-------+------+---------+---------+------|
  | # | Fortitude     |     8 |    7 |       1 |         |      |
  | # | Reflex        |     7 |    5 |       2 |         |      |
  | # | Will          |     9 |    5 |       4 |         |      |
  |---+---------------+-------+------+---------+---------+------|
  #+TBLFM: $5=remote(Stats,@3$Modifier)::@2$3..@4$3=vsum($4..$7)::@2$4=remote(ClassGestalt, @>$Fort)::@2$5=remote(Stats, @4$Modifier)::@3$4=remote(ClassGestalt, @>$Ref)::@4$4=remote(ClassGestalt, @>$Will)::@4$5=remote(Stats, @6$Modifier)

  #+NAME:HP
  |---+--------------+----|
  | # | Base         | 26 |
  |   | Temporary HP | 26 |
  |---+--------------+----|
  | # | Total        | 26 |
  |---+--------------+----|
  #+TBLFM: @1$3=remote(ClassGestalt, @2$HP)::@3$3=@1$3+@2$3

  #+NAME:AC
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | ! | Type      | Total | Base | Armor | Shield | Dex | Size | Dodge | Natural | Deflect | Misc |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  | # | AC        |    15 |   10 |     2 | 0      |   2 |    0 |     1 |       0 |       0 |      |
  | # | Touch     |    13 |   10 |   N/A | N/A    |   2 |    0 |     1 |     N/A |       0 |      |
  | # | Flat-foot |    12 |   10 |     2 | N/A    | N/A |    0 |   N/A |       0 |       0 |      |
  |---+-----------+-------+------+-------+--------+-----+------+-------+---------+---------+------|
  #+TBLFM: @2$3..@>$3=vsum($4..$12);N::@2$5=remote(Armor, @2$AC)::@2$6=0::@2$7..@3$7=min(remote(Stats, @3$Modifier), remote(Armor, @>$6)::@2$8..@>$8=remote(Size, @2$1)::@4$5=remote(Armor, @2$AC)

  #+NAME:CMD
  |---+-----+-------+------+-----+-----+-----+------+------|
  | ! |     | Total | Base | BAB | Dex | Str | Size | Misc |
  |---+-----+-------+------+-----+-----+-----+------+------|
  | # | CMD |    15 |   10 |   3 |   2 |  -4 |    0 |    4 |
  |---+-----+-------+------+-----+-----+-----+------+------|
  #+TBLFM: @2$3=vsum($4..$9)::@2$5=remote(ClassGestalt, @>$BAB)::@2$6=remote(Stats, @3$Modifier)::@2$7=remote(Stats, @2$Modifier)::@2$8=remote(Size, @2$1)

  #+NAME:Resistances
  |------------------+---|
  | Damage Reduction |   |
  | Spell Resistance |   |
  |------------------+---|

* Attacks
  #+NAME:Attacks
  |---+--------+-------+-------------------+---------+------+------|
  | ! |        | Total | Base Attack Bonus | Ability | Size | Misc |
  |---+--------+-------+-------------------+---------+------+------|
  | # | Melee  |    -1 |                 3 |      -4 |    0 |      |
  | # | Ranged |     5 |                 3 |       2 |    0 |      |
  | # | CMB    |    -1 |                 3 |      -4 |    0 |      |
  |---+--------+-------+-------------------+---------+------+------|
  #+TBLFM: @2$3..@4$3=vsum($4..$7)::@2$4..@4$4=remote(ClassGestalt, @>$BAB)::@2$5=remote(Stats, @2$Modifier)::@2$6=remote(Size, @2$1)::@3$5=remote(Stats, @3$Modifier)::@3$6=remote(Size, @2$1)::@4$5=remote(Stats, @2$Modifier)::@4$6=remote(Size, @2$1)

  #+NAME:Weapons
  |---+-------------------+---------+------------------+--------+------+-------+------+------+------------------|
  | ! | Weapon            | Enhance | Attack Modifiers | Damage | Crit | Range | Size | Type | Notes            |
  |---+-------------------+---------+------------------+--------+------+-------+------+------+------------------|
  |   | Masterwork Musket |         |               +1 |   1d12 | x4   |    40 | M    | B/P  | Misfire 1-2(5ft) |
  |---+-------------------+---------+------------------+--------+------+-------+------+------+------------------|

* Skills
  # To mark as a class skill just put a 1 in the class column, org mode doesn't
  # support checkboxes in tables yet. You can add or change the ability the
  # stat depends on by modifying the Stat column. If a skill is affected by
  # armor penalty just mark it with a 1 in the Armor Penalty column
  #+NAME:Skills
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | ! | TR | AP | Class | Skill                | Stat | Total  | Ranks | Ability | Trained | Misc |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |    |  1 |     1 | Acrobatics           | Dex  | 6      |     1 |       2 |       3 |      |
  | # |    |    |     1 | Appraise             | Int  | -2     |       |      -2 |         |      |
  | # |    |    |     1 | Bluff                | Cha  | -2     |       |      -2 |         |      |
  | # |    |  1 |     1 | Climb                | Str  | -4     |       |      -4 |         |      |
  | # |    |    |     1 | Craft (Alchemy):     | Int  | 2      |     1 |      -2 |       3 |      |
  | # |    |    |       | Diplomacy            | Cha  | -2     |       |      -2 |         |      |
  | # |  1 |  1 |       | Disable Device       | Dex  | -      |       |       2 |         |      |
  | # |    |    |       | Disguise             | Cha  | -2     |       |      -2 |         |      |
  | # |    |  1 |       | Escape Artist        | Dex  | 2      |       |       2 |         |      |
  | # |    |  1 |     1 | Fly                  | Dex  | 8      |     3 |       2 |       3 |      |
  | # |  1 |    |     1 | Handle Animal        | Cha  | -      |       |      -2 |         |      |
  | # |    |    |     1 | Heal                 | Wis  | 6      |       |       4 |         |    2 |
  | # |    |    |     1 | Intimidate           | Cha  | -2     |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Arcana    | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Dungeon   | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Engineer  | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Geography | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: History   | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Local     | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Nature    | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Nobility  | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Planes    | Int  | -      |       |      -2 |         |      |
  | # |  1 |    |     1 | Knowledge: Religion  | Int  | -      |       |      -2 |         |    2 |
  | # |  1 |    |     1 | Linguistics          | Int  | -      |       |      -2 |         |      |
  | # |    |    |     1 | Perception           | Wis  | 10     |     1 |       4 |       3 |    2 |
  | # |    |    |       | Perform:             | Cha  | -2     |       |      -2 |         |      |
  | # |  1 |    |     1 | Profession:          | Wis  | -      |       |       4 |         |      |
  | # |    |  1 |     1 | Ride                 | Dex  | 2      |       |       2 |         |      |
  | # |    |    |       | Sense Motive         | Wis  | 4      |       |       4 |         |      |
  | # |  1 |  1 |     1 | Sleight of Hand      | Dex  | -      |       |       2 |         |      |
  | # |  1 |    |     1 | Spellcraft           | Int  | -      |       |      -2 |         |      |
  | # |    |  1 |       | Stealth              | Dex  | 4      |       |       2 |         |    2 |
  | # |    |    |     1 | Survival             | Wis  | 4      |     1 |       4 |         |      |
  | # |    |  1 |     1 | Swim                 | Str  | -3     |       |      -3 |         |      |
  | # |  1 |    |       | Use Magic Device     | Cha  | -      |       |      -2 |         |      |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  | # |    |    |       |                      |      | Total: |     7 |         |         |      |
  |---+----+----+-------+----------------------+------+--------+-------+---------+---------+------|
  #+TBLFM:@2$7..@-1$7=if(($2 > 0 && $8 > 0) || ($2 == 0), vsum($8..$11)+($3*remote(Armor, @>$Penalty)), string("-"))::@2$9..@-1$9='(cond ((string= $6 "Str") remote(Stats, @2$Modifier)) ((string= $6 "Dex") remote(Stats, @3$Modifier)) ((string= $6 "Int") remote(Stats, @5$Modifier)) ((string= $6 "Wis") remote(Stats, @6$Modifier)) ((string= $6 "Cha") remote(Stats, @7$Modifier)))::@2$10..@-1$10=if($4 > 0 && $8 > 0, 3, string(""))::@>$8=vsum(@2$8..@-1$8)

* Inventory

** Equipment
   # Just add new rows for new items
   #+NAME:Equipment
   |---+-----------------------+----------+------------------+---------------|
   | ! | Name                  | Quantity | Effective Weight | Actual Weight |
   |---+-----------------------+----------+------------------+---------------|
   |   | Old Musket            |        1 |                9 |             9 |
   |   | Lamellar Cuirass      |        1 |                8 |             8 |
   |   | Spell component pouch |        1 |                2 |             2 |
   |   | Backpack (Masterwork) |        1 |                2 |             2 |
   |   | Gunsmith's kit        |        1 |                2 |             2 |
   |   | Flint and steel       |        1 |                  |               |
   |   | Bedroll               |        1 |                5 |             5 |
   |   | Torch                 |        5 |                1 |             1 |
   |   | Soldier's Uniform     |        1 |                5 |             5 |
   |   | Bullets               |       27 |                  |               |
   |   | Black Powder          |       27 |                  |               |
   |   | Paper Cartridge       |        8 |                  |               |
   |   | Powder Horn           |        3 |                1 |             1 |
   |   | Silk Rope             |     50ft |                5 |             5 |
   |   | Cure Mod Pot.         |        1 |                  |               |
   |---+-----------------------+----------+------------------+---------------|
   | # | Total Weight:         |          |               35 |            35 |
   |---+-----------------------+----------+------------------+---------------|
   #+TBLFM: @>$4=vsum(@2$4..@-2$4)::@>$5=vsum(@2$5..@-2$5)

   # Worn magic items
   #+NAME:WornEquipment
   |-----------+----------------------|
   | Head      |                      |
   | Face      |                      |
   | Throat    |                      |
   | Shoulders |                      |
   | Body      |                      |
   | Torso     |                      |
   | Arms      |                      |
   | Hands     |                      |
   | Ring      |                      |
   | Ring      |                      |
   | Waist     | Beneficial Bandolier |
   | Feet      |                      |
   |-----------+----------------------|

   #+NAME:Armor
   |---+---------+------------------+---------+----+---------+---------+----------------+-------+------+----------|
   | ! | Type    | Name             | Enhance | AC | Max Dex | Penalty | Spell Fail (%) | Type  | Size | Material |
   |---+---------+------------------+---------+----+---------+---------+----------------+-------+------+----------|
   |   | Armor   | Lamellar Cuirass |         |  2 |       4 |       0 |             5% | Light | M    |          |
   |---+---------+------------------+---------+----+---------+---------+----------------+-------+------+----------|
   | # | Totals: |                  |         | 12 |       4 |       0 |           0.05 |       |      |          |
   |---+---------+------------------+---------+----+---------+---------+----------------+-------+------+----------|
   #+TBLFM: @>$5=10+vsum(@2$5..@-1$5)::@>$6=@2$6::@>$7=vsum(@2$7..@-1$7)::@>$8=vsum(@2$8..@-1$8)

** Wealth
   #+NAME:Wealth
   |----------+--------|
   | Platinum |        |
   | Gold     | 310.92 |
   | Silver   |        |
   | Copper   |        |
   |----------+--------|

** Bags and Containers
   #+NAME:Bags
   |-----------+--------+--------|
   | Container | Volume | Weight |
   |-----------+--------+--------|
   | Backpack  | 2ft^3  |      2 |
   |-----------+--------+--------|
* Spells
  #+NAME:CastingStat
  |---+--------------+-----+---|
  | # | Casting Stat | Wis | 4 |
  |---+--------------+-----+---|
  #+TBLFM:@1$4='(cond ((string= $3 "Int") remote(Stats, @5$Modifier)) ((string= $3 "Wis") remote(Stats, @6$Modifier)) ((string= $3 "Cha") remote(Stats, @7$Modifier)))

  #+NAME:SpellInfo
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | ! | Save DC | Spell Level | Total | Class Bonus | Ability | Misc | Total Known |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  | # |         |           0 |     0 |           0 |         |      |           4 |
  | # |      15 |           1 |     5 |           4 |       1 |      |           2 |
  | # |      16 |           2 |     5 |           4 |       1 |      |             |
  | # |      17 |           3 |     4 |           3 |       1 |      |             |
  | # |      18 |           4 |     4 |           3 |       1 |      |             |
  | # |      19 |           5 |     4 |           4 |       0 |      |             |
  | # |      20 |           6 |     3 |           3 |       0 |      |             |
  | # |      21 |           7 |     2 |           2 |       0 |      |             |
  | # |      22 |           8 |     1 |           1 |       0 |      |             |
  | # |      23 |           9 |     0 |             |       0 |      |             |
  |---+---------+-------------+-------+-------------+---------+------+-------------|
  #+TBLFM: $4=vsum($5..$7)::$2=if($4 > 0, 10+$3+remote(CastingStat, @1$4), string(""))::@3$6..@>$6=max(0, (remote(CastingStat, @1$4)-$3)\4+1)
  # 

  #+NAME:CasterLevel
  |--------------+---|
  | Caster Level | 2 |
  |--------------+---|

  #+NAME:Concentration
  |---+---------------+-------+------+---------+------|
  | ! |               | Total | Base | Ability | Misc |
  |---+---------------+-------+------+---------+------|
  | # | Concentration |     6 |    2 |       4 |      |
  |---+---------------+-------+------+---------+------|
  #+TBLFM: @2$3=vsum($4..$6)::@2$4=remote(CasterLevel, @1$2)::@2$5=remote(CastingStat, @1$4)

  #+NAME:SpellRanges
  |---+--------+-----|
  | # | Close  |  30 |
  | # | Medium | 120 |
  | # | Long   | 480 |
  |---+--------+-----|
  #+TBLFM: @1$3=25+remote(CasterLevel,@1$2)*5/2::@2$3=100+remote(CasterLevel, @1$2)*10::@3$3=400+remote(CasterLevel, @1$2)*40

  #+NAME:SorcSpells
  |------------+-------+---------------------+-------------+---------|
  | # Prepared | Level | Name                | Description | Save DC |
  |------------+-------+---------------------+-------------+---------|
  |            |     0 | Detect Magic        |             |      14 |
  |            |     0 | Dancing Lights      |             |      14 |
  |            |     0 | Prestidigitation    |             |      14 |
  |            |     0 | mage hand           |             |      14 |
  |            |     1 | Reduce Person       |             |      15 |
  |            |     1 | Abundant Ammunition |             |      15 |
  |            |     1 | Burning Hands       |             |      15 |
  |            |     1 | Snowball            |             |      15 |
  |------------+-------+---------------------+-------------+---------|

  #+NAME:WizSpells
  |------------+-------+--------------+-------------+---------|
  | # Prepared | Level | Name         | Description | Save DC |
  |------------+-------+--------------+-------------+---------|
  |            |     1 | Read Magic   |             |       9 |
  |            |     1 | Detect Magic |             |       9 |
  |------------+-------+--------------+-------------+---------|

* Transients
4/4 grit
13 rounds abundant ammunition
0 +1 attack/damage
** Loot
Silversheen
Transport token
Masterwork bastard sword
Other treasure (Gorloth)
magic belt
cure moderate wounds potion
2x cure light wounds potion
scroll of inflict light wounds
hand of the mage
bone dice
42 copper pieces
